component/onvif/onvifgen/xml/RecordingBinding.ExportRecordedData.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:ns1="http://www.onvif.org/ver20/analytics/humanface"
    xmlns:ns2="http://www.onvif.org/ver20/analytics/humanbody"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl"
    xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:tls="http://www.onvif.org/ver10/display/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
    xmlns:trp="http://www.onvif.org/ver10/replay/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
    xmlns:tse="http://www.onvif.org/ver10/search/wsdl">
 <SOAP-ENV:Body>
   <trc:ExportRecordedData>
    <trc:StartPoint xsi:type="xsd:dateTime">2021-05-24T03:37:12Z</trc:StartPoint>
    <trc:EndPoint xsi:type="xsd:dateTime">2021-05-24T03:37:12Z</trc:EndPoint>
    <trc:SearchScope xsi:type="tt:SearchScope">
     <tt:IncludedSources xsi:type="tt:SourceReference" Type="http://www.onvif.org/ver10/schema/Receiver">
      <tt:Token xsi:type="tt:ReferenceToken"></tt:Token>
      <!-- extensibility element(s) -->

     </tt:IncludedSources>
     <tt:IncludedRecordings xsi:type="tt:RecordingReference"></tt:IncludedRecordings>
     <tt:RecordingInformationFilter xsi:type="tt:XPathExpression"></tt:RecordingInformationFilter>
     <tt:Extension xsi:type="tt:SearchScopeExtension">
      <!-- extensibility element(s) -->

     </tt:Extension>
    </trc:SearchScope>
    <trc:FileFormat xsi:type="xsd:string"></trc:FileFormat>
    <trc:StorageDestination xsi:type="tt:StorageReferencePath">
     <tt:StorageToken xsi:type="tt:ReferenceToken"></tt:StorageToken>
     <tt:RelativePath xsi:type="xsd:string"></tt:RelativePath>
     <tt:Extension xsi:type="tt:StorageReferencePathExtension">
      <!-- extensibility element(s) -->

     </tt:Extension>
    </trc:StorageDestination>
   </trc:ExportRecordedData>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
